all_codes = [{
    "name": "【第一週】國旅券",
    "codes": ['21', '32', '98', '67', '97', '410']
  }, {
    "name": "【第一週】i原券",
    "codes": ['64', '85']
  }, {
    "name": "【第一週】農遊券",
    "codes": ['89', '32', '54', '597', '453', '152']
  }, {
    "name": "【第一週】藝fun券(數位)",
    "codes": ['96', '15', '07', '30', '73', '98', '19', '11']
  }, {
    "name": "【第一週】藝fun券(紙本)",
    "codes": ['39', '37', '23', '36', '79', '08', '14', '75']
  }, {
    "name": "【第一週】動滋券",
    "codes": ['97', '13', '19', '55', '71', '93', '381', '734', '644', '453', '985']
  }, {
    "name": "【第一週】客庄劵2.0",
    "codes": ['81', '900']
  }, {
    "name": "【第一週】地方創生券",
    "codes": ['081', '105', '594', '188', '089', '396', '521', '467', '912', '798', '358', '441', '367', '941', '335']
  }, {
    "name": "【第二週】國旅券",
    "codes": ['87', '04', '40', '29', '71']
  }, {
    "name": "【第二週】i原券",
    "codes": ['12', '59']
  }, {
    "name": "【第二週】農遊券",
    "codes": ['50', '13']
  }, {
    "name": "【第二週】藝fun券(數位)",
    "codes": ['78', '00', '39', '22', '61', '23', '15']
  }, {
    "name": "【第二週】藝fun券(紙本)",
    "codes": ['37', '76', '31', '06', '51', '65', '81']
  }, {
    "name": "【第二週】動滋券",
    "codes": ['91', '11', '04', '18', '57', '498', '756']
  }, {
    "name": "【第二週】客庄劵2.0",
    "codes": ['11', '439', '841', '052', '206', '161', '457', '205', '012', '293', '446', '589']
  }, {
    "name": "【第二週】地方創生券",
    "codes": ['598', '880', '886', '675', '684', '568', '645', '456']
  }, {
    "name": "【第三週】國旅券",
    "codes": ['44', '34', '09', '55', '35', '041']
  }, {
    "name": "【第三週】i原券",
    "codes": ['48', '49']
  }, {
    "name": "【第三週】農遊券",
    "codes": ['60', '75']
  }, {
    "name": "【第三週】藝fun券(數位)",
    "codes": ['01', '92', '19', '23', '79', '95', '48', '46']
  }, {
    "name": "【第三週】藝fun券(紙本)",
    "codes": ['31', '56', '02', '52', '44', '49', '00', '47', '59']
  }, {
    "name": "【第三週】動滋券",
    "codes": ['82', '45', '57', '53', '00', '546', '855', '865', '012', '983']
  }, {
    "name": "【第三週】客庄劵2.0",
    "codes": ['14', '269']
  }, {
    "name": "【第三週】地方創生券",
    "codes": ['771', '706', '064', '168', '191', '459', '135', '314', '366']
  }, {
    "name": "【第四週】國旅券",
    "codes": ['32', '02', '87', '93', '82', '17']
  }, {
    "name": "【第四週】i原券",
    "codes": ['29', '82', '71']
  }, {
    "name": "【第四週】農遊券",
    "codes": ['315', '740', '381', '264', '285', '765', '682', '763', '373', '015', '374']
  }, {
    "name": "【第四週】藝fun券(數位)",
    "codes": ['70', '61', '37', '85', '67', '35', '44']
  }, {
    "name": "【第四週】藝fun券(紙本)",
    "codes": ['75', '72', '71', '28', '67', '82', '93', '56', '34', '07']
  }, {
    "name": "【第四週】動滋券",
    "codes": ['30', '03', '51', '88']
  }, {
    "name": "【第四週】客庄劵2.0",
    "codes": ['69']
  }, {
    "name": "【第四週】地方創生券",
    "codes": ['743', '201', '119', '828', '221', '750', '046']
  }]
def get_coupons_result(my_code):
    result = []
    result_text = ''
    for i in all_codes:
        for code in i['codes']:
            if len(code) == 2:
                check_code = my_code[-2:]
            else:
                check_code = my_code
            if check_code == code:
                result.append(i.get('name'))
    for i in result:
        result_text += i
        result_text += '\n'
    if result_text == '':
      result_text = '你是國家邊緣人....'
    return result_text